       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       PROCEDURE DIVISION.
       DISPLAY 'Hello, world'.
       PERFORM SAM.
       PERFORM SAM1.
       STOP RUN.
       

       SAM.
       DISPLAY 'SAM'.
       SAM1.
       DISPLAY 'SAM1'.
       EXIT.
       SAM2.
       DISPLAY 'SAM2'.
       EXIT.
       
       FIN.
       
       